app/Models/RegistryModel.php

    public function update_data($tblname, $data)
    {
        $builder = $this->db->table($tblname);
        $builder->update($data)->where($data['perspectiveid']);
---
UPDATE `perspective` SET `name` = 'dawdarordawdawajgj'
WHERE `perspectiveid` = '28'